from func_classes import *

TEXTS = {
    'start': 'Привет! 👻 Я твой бот-помощник!',
    'begin': '🗿 Начать',
    'select_skript': 'Выберите действие',
    'select_wh': 'Выберите склад',
    'select_category': 'Выберите категорию',
    'select_goods': 'Выберите товар',
    'send_photo': 'Пришлите фото',
    'set_count': 'Укажите количество для списания',
    'error_wh': 'В 1С не найдено ни одного склада Микромаркета',
    'error_category': 'В 1С не найдено ни одного товара на складе Микромаркета',
    'error_goods': 'Не найдено такого товара',
}


KEYBOARDS_TEXT_FUNC = {
    'write_off_goods': ['♻ Списать товар'],
    'inventory': ['☑ Инвентаризация'],
    'update_balances': ['🔃 Обновить остатки'],
    'back_to_start': ['🔙 Вернуться в начало'],

}
